[
    {
        "articleDatePosted": "Dec. 21, 2017",
        "articleAuthor": "Liz Mair Opinion Contributor",
        "articleTitle": "The Trump Presidency: A Success Story",
        "articleHotness": "2",
        "articleUrl": "https://www.usnews.com/opinion/articles/2017-12-21/donald-trump-is-the-most-successful-first-year-president-of-all-time?fbclid=IwAR27nl_ivSU6h6XXGuuiej4vCbSZaLGt-ROL6S87ekACE9cKyuVCrKjFuOU",
        "articleSentence": "Trump has the opportunity to solidify his position as the most successful president ever in his first year.",
        "text": "(Chip Somodevilla/Getty Images)\n\nWhat would you say if I told you that Donald Trump is one step away from securing a legacy as the most successful first-year president ever?\n\nOn one level, it sounds crazy. The president has spent year one mired in controversy over crazy tweets involving alleged face-lifts of TV stars, horrifically ignorant and ill-advised comments about white nationalists, alleged personal profiting off the presidency, supposed interference in criminal investigations and the connections of multiple members of his campaign and administration team to Russia – and more.\n\nBut when it comes to actual policy accomplishments tied to pledges he made on the campaign trail, Trump is actually doing pretty well – whether you like the results or not.\n\nThis week, the House and Senate passed a tax bill that arguably makes the most sweeping changes to the tax code since Ronald Reagan. The bill will slash corporate taxes by more than either of Trump's last two Republican predecessors could. It will cut taxes dramatically for a wide swath of small businesses, namely those who file on a pass-through basis. It will double the child tax credit. The left-leaning Tax Policy Center estimated at the beginning of the week that should the bill be signed into law, 80 percent of taxpayers would see a tax cut, while less than 5 percent would see a tax increase of more than $10. It is an imperfect bill, and one that perhaps should not be dubbed \"tax reform,\" but still a significant one that more or less adheres to what Trump promised on the campaign trail – and which will have notable effects on the budgets of many families and businesses across the country. And Trump will sign it into law before he even celebrates the first anniversary of his inauguration.\n\nThe tax bill also repeals the Affordable Care Act's individual mandate, arguably the most noxious portion of Obamacare viewed through a limited government, classical liberal perspective. Just two weeks ago, this was viewed as an iffy prospect at best, because the mandate is viewed as so integral to the ACA succeeding, to the extent that is even theoretically possible, long-term, given other components of the law. With the signing of the tax bill, the individual mandate will be history. So are ACA cost-sharing reductions, or subsidies, which Trump already nixed. While that does not amount to Obamacare repeal – not even close – it's still significant movement to dismantle the ACA, even if it ultimately forces American health care in the direction of European counterparts by making single-payer health care more appealing long-term.\n\nTrump has rolled back loads of government regulations, partly thanks to his \"two out, one in\" policy by which every new regulation can only come into effect if two existing regulations are repealed. He appears likely to succeed in sending Office of Management and Budget Chief Mick Mulvaney to head the Consumer Financial Protection Bureau as a longer-term fixture, a crippling blow to its ex-head, Richard Cordray, and ideological parent, Elizabeth Warren.\n\nHe has pulled the U.S. out of the Paris climate accord. He has pulled the U.S. out of the Trans-Pacific Partnership trade deal. He has put the North American Free Trade Agreement seriously under the gun, with the likelihood higher than ever that Canada and Mexico will simply walk away from it due to American demands. He has made good on promises to vastly increase deportations of unlawful immigrants and curtail legal immigration. While the original iteration of his Middle East travel ban did not pass judicial muster, the revised version is sticking. He has gone beyond rhetorical commitments to move the U.S. embassy to Jerusalem and recognize the city as Israel's capital.\n\nPerhaps most significantly, in his first year, Trump has gotten numerous conservative judges confirmed and in place. Neil Gorsuch is the most obvious example – his position on the Supreme Court could affect American law and jurisprudence for decades or more to come. But Trump has also put 12 circuit court judges on the bench, as The Washington Post notes, \"the most during a president's first year in office in more than 100 years.\"\n\nYet there is one last thing that Trump could do, before he reaches the anniversary of his inauguration, to cement his legacy as one of the most successful – if not the most successful – first-year president ever: Get Congress to pass legislation that protects DACA recipients, and avoid scuttling a deal to do so by attaching too many anti-immigration, restrictionist measures to a DACA bill.\n\nTrump has repeatedly promised to protect DREAMers, calling them \"people that were brought here, people that have done a good job and were not brought here of their own volition.\" According to a Morning Consult survey conducted earlier this year, 72 percent of Republicans want DREAMers allowed to stay in the U.S., with 48 percent favoring an outright pathway to citizenship for them. As Sen. Lamar Alexander, R-Tenn., has noted, Trump is probably the one guy who can easily get a deal done to protect DREAMers should he throw real weight behind it, as he did the tax bill.\n\nThe question is simply whether Trump will actually do it; make too many demands, particularly with regard to mandatory, nationwide e-Verify, or eliminating all chain migration save for minor children and spouses, and he may fail on what could otherwise be a signature achievement, bleeding civil libertarians on the left and right over e-Verify, and both potential Democratic and Republican votes on the family migration front. But cut a deal that steps up border security while codifying DACA, and Trump could add multiple cherries, whipped cream and sprinkles to what already looks like a pretty sizeable, if incomplete, banana split.\n\nGiven Trump's fervent belief that he is the best deal-maker, the most successful when it comes to delivering real results, why would he forsake this opportunity, given how well it polls and how easily it could enable him to set the stage for other Trump priorities to be pursued in year two – namely, infrastructure, and most likely dealing more concertedly with North Korea?\n\nThe reality is that Trump, and Republicans, may not wind up getting credit for the tax reductions they just passed into law that will affect many Americans – and not just fabled GOP donors. Businesses, who pay taxes quarterly, will notice reductions quickly. But a lot of individual taxpayers will only come to realize what benefits lie in the tax bill after they've voted in the 2018 midterm elections, and when they file their tax returns in April 2019 – and right now, fair or not, the tax bill does not appear popular.\n\nIt would make sense for Trump to finish out his first year by giving voters, especially those DREAMer-protecting-favorable ones who could swing against him and live primarily in suburbs, something else they like that is tangible before walking into next November – and not holding a negotiating position that means his administration is wiping an easy victory off the table with demands that a lot of Republicans, as well as Democrats, will regard as unreasonable.\n\nThis is Trump's challenge as Christmas approaches. Can he use the last 20-some days of his first year in office to put those last few points on the board, and solidify his record even more? Or will he leave good press – and votes – on the table unnecessarily?"
    },
    {
        "articleDatePosted": "Oct 19, 2018",
        "articleAuthor": "Donald Trump Jr",
        "articleTitle": "Donald Trump Is Making Canada Great Again",
        "articleHotness": "3",
        "articleUrl": "https://www.forbes.com/sites/kriskrane/2018/10/19/donald-trump-is-making-canada-great-again/",
        "articleSentence": "On Wednesday, Canada became the second country in the world to legalize marijuana for adults, and the first to do so with a fully regulated commercial..",
        "text": "On Wednesday, Canada became the second country in the world to legalize marijuana for adults, and the first to do so with a fully regulated commercial market. This has rightfully been big news on both sides of the border, as Americans wait for the United States to catch up with our more enlightened neighbor to the north and finally end prohibition here at home.\n\nThe problem now is that in failing to have kept pace with our northern neighbor, the Trump Administration and Congress are potentially giving away the world’s next great industry to Canada.\n\nFor an administration that came into power on an “America First” agenda, railed against international trade deals for being unfair to the United States, and promised to create new jobs here at home, its current stance on marijuana policy could not be any more counter to their stated goals. If anything, the Trump Administration’s current stance on the cannabis industry can only be described as “Canada First.”\n\nIn a previous column, I laid out the political case for why President Trump should embrace legalization. Early indications are that the administration is at least considering this point of view. Recently, Republican Congressman Dana Rohrabacher (R-CA), one of the strongest supporters of cannabis legalization in Congress, told the press that President Trump is likely to push for some kind of legalization after the midterms. Meanwhile, Tom Angell of Marijuana Moment reported right here on Forbes that Congressman Blumenauer (D-OR), another of Congress’ strongest supporters of ending prohibition, has been imploring Democrats to get more aggressive on this issue, fearing that their continued failure to do so will allow President Trump to take this issue and the associated political gains from the party in advance of the 2020 elections. In a letter to Congressional Democratic leadership he wrote, “If we fail to act swiftly, I fear as the 2020 election approaches, Donald Trump will claim credit for our work in an effort to shore up support—especially from young voters.”\n\nWhile it is encouraging to see potential movement on this issue in the coming years, this administration's failure to act, like those that preceded it from both political parties, has put American cannabis companies at a significant disadvantage compared to their Canadian counterparts. For the biggest proof of this, look no further than public market activity around cannabis businesses. While some American companies like MedMen and Green Thumb Industries have enjoyed public market valuations north of $2 billion, these pale in comparison to their Canadian counterparts. The largest Canadian publicly traded companies have received much higher public market valuations on average, giving them access to cheaper capital and a stronger currency to make acquisitions in the industry. Canopy Growth currently has a valuation of $11.6 billion, Aphria is at $3.7 billion, and Tilray notoriously had a market cap of nearly $20 billion in mid September, before coming back to a still impressive $13.8 billion as of Wednesday.\n\nThe great irony with these publicly traded companies is that Canadian companies are financially benefiting from American investment activity, while American companies are forced to go north for their public market activity. Tilray’s valuation explosion happened on the NASDAQ, where Cronos also trades, while Canopy Growth is listed on the New York Stock Exchange, which is also soon to be the home of Aurora Cannabis. While this has benefitted American public sector investors, most of those gains leave the country for Canada where the companies are based and where most of their stock is held.\n\nMeanwhile, American companies are barred from listing on an exchange in the United States because federal law still deems their activity to be illegal. Even when listed in Canada, American cannabis companies cannot access the country’s largest exchange, the Toronto Stock Exchange, who will list Canadian marijuana companies but not any that engage in federally illegal conduct. American companies instead are listed on the secondary Canadian Securities Exchange, which ironically is experiencing a resurgence due largely to American cannabis company listings. This leads to a disproportionate amount of investment into American companies coming from Canadian public sector investors, with many of these profits staying in Canada and benefiting the Canadian economy, while American investors largely sit on the sidelines.\n\nPart of the reason that Canadian companies enjoy such high valuations is their ability to access international markets, which remain largely off limits to American companies. A country of 36 million people is likely not enough to support several multi-billion dollar cannabis companies. These valuation boosts have largely been based off of Canada’s massive international head start. Many of these companies have built production facilities in Europe, or have bought interest in cannabis licenses around the world. American companies, still viewed as drug traffickers by the Trump Administration and the federal government at large, are unable to export their products to these emerging international markets. States like Oregon, which has a massive oversupply issue but is known for producing some of the best quality cannabis in the world, is not allowed to sell that product across state lines, let alone to import into European markets.\n\nIf this situation doesn’t change soon, the federal government will likely have ceded the next great global industry to Canada. Many people have speculated that when federal prohibition ends, alcohol and tobacco companies will come in and acquire the current leaders of the American cannabis industry. While that may be true to a degree, the meaningful head start that we are giving to Canadian companies, with their massive valuations, access to cheap capital, and international assets, means that even when this does become legal across the United States it may very well be Canadians who wind up acquiring and owning the most prized American cannabis assets. It is not too late to reverse this trend, but the federal government must act fast to give Americans a fighting chance to compete in this growing global market.\n\nThis has led to U.S. businesses literally begging the Trump administration to take proactive action in order to level the playing field. Terra Tech, which is based in Irving, Calif., and trades in the over-the-counter market in the United States, recently took out a full-page ad in the Wall Street Journal on the eve of legalization day in Canada imploring the president to legalize cannabis in the United States. The letter starts by rightly pointing out how the federal government's inaction has put American business at a significant disadvantage.\n\n“The rapidly growing American cannabis industry represents an extraordinary economic opportunity for our country, yet Canada is threatening to deprive American farmers, workers and businesses from the prosperity that rightly belongs within our borders.”\n\nThere is only one way to give American cannabis companies a chance to compete with their counterparts to the north, despite the head start they already enjoy. That is is for the Trump Administration to remove the shackles by legalizing marijuana in the United States. If this administration truly cares about creating jobs and opportunities for American businesspeople, workers, farmers and investors, they will not wait until it is politically expedient to support legalization, although that should have already occurred as well, but will move aggressively to legalize now. The longer they wait, the more likely that they will have given the future of this industry to Canada.\n\nPresident Trump, stop making Canada Great Again and give American companies the boost they need to make cannabis the next great American industry."
    },
    {
        "articleDatePosted": "09 Jan 2018",
        "articleAuthor": "Hannah Long-Higgins",
        "articleTitle": "What the world thinks of Trump's first year as US president",
        "articleHotness": "8",
        "articleUrl": "https://www.bbc.com/news/av/world-us-canada-42626890/what-the-world-thinks-of-trump-s-first-year-as-us-president",
        "articleSentence": "Donald Trump's first year in the White House has been followed closely around the world. We asked people on the streets of seven cities what they made of it.",
        "text": "Video\n\nDonald Trump's first year in the White House has been followed closely around the world. We asked people on the streets of seven cities what they made of it.\n\nEdited by Hannah Long-Higgins"
    },
    {
        "articleDatePosted": "February, 23 2017",
        "articleAuthor": "Peter Silverstone",
        "articleTitle": "Is Donald Trump bad, mad—or both?",
        "articleHotness": "7",
        "articleUrl": "https://www.folio.ca/opinion-is-donald-trump-bad-mador-both/",
        "articleSentence": "We don’t need an armchair psychiatric diagnosis of the U.S. president to explain his bad behaviour, argues UAlberta psychiatrist.",
        "text": "Is President Donald Trump mad, mad and bad, or just bad? This question arises because of increasing speculation about whether or not President Trump is mentally ill. Recently, mental health professionals have weighed in—most notably in a Feb. 14 letter to The New York Times suggesting that Mr. Trump is incapable, on psychiatric grounds, of serving as president.\n\nI think a clear case can be made that President Trump is bad, but he is definitely not mad in the sense of having a mental illness. However, he is frequently mad in the sense of being angry. Mental health diagnoses are widely misunderstood, as is the difference between being \"bad\" and being \"mad.\"\n\nPeople who carry out bad things are often talked about in terms such as \"they must be crazy,\" implying the presence of a mental health disorder. It is true that at times individuals who are psychotic do bad things, but this is a tiny minority of such acts. And when they occur, they are usually widely reported. An example is the tragic episode involving a murder, beheading and cannibalization that occurred on a Greyhound bus in 2008.\n\nOne of the widely misunderstood issues is that mental health professionals will only make a diagnosis, such as psychosis, when any such beliefs are NOT compatible with those held by others, no matter how odd or unusual they may be. This means that people who belong to small groups with unusual beliefs do not receive mental health diagnoses. Thus, whether or not such beliefs are factually based is not the basis for a diagnosis. Even when people believe things that are clearly factually inaccurate, they are not \"mad\" or \"crazy\" in a mental health sense. If this were not the case, individuals who believe that Elvis is still alive, that cigarettes don't cause cancer, that 9/11 was a U.S. conspiracy, that humans didn't arise from evolution or that global warming is not occurring would meet the criteria for mental illness.\n\nThere have been concerns raised that mental health professionals should not try and make a diagnosis from a distance, and in the United States (but not in Canada) there have been specific guidelines to this effect. I am less concerned about this, as this has always felt inappropriate. If somebody shows evidence of mental health conditions that can be diagnosed from a distance, it will usually be highly apparent, such as somebody calling to police to shoot them or running naked in the streets. Additionally, we constantly make judgments about guilt or innocence of individuals on trial for a variety of offences based only on what is available in the media, and without understanding all of the evidence.\n\nTherefore, while individuals can propound many beliefs that are not compatible with facts - of which President Trump is a good example - this does not make him \"mad.\" Is he bad? There are many reasons to believe that his actions, beliefs, statements, instability, lying, bullying, misogyny and narcissistic behaviour would make most individuals believe that he is bad. So, President Trump is not mad and bad, just bad.\n\nWe should move on from looking for a mental health diagnosis to explain why President Trump is the person he is, and just recognize how frequently bad people occupy positions of power in many countries.\n\nPeter Silverstone is a professor of psychiatry at the University of Alberta.\n\nThis article originally appeared in The Globe and Mail."
    }
]